import 'package:flutter/material.dart';

class Constants {
  static const textFieldColor = Color(0xFFF1F6FF);
  static const darkColor = Color(0xFF1F1F1F);
  static const color2 = Color(0xFF09c6f9);
  static const String patientsCollectionName = 'patients';
  static const String doctorsCollectionName = 'doctors';
  static const String appName = 'مرضى الفشل الكلوى';
  static const List<String> foods = [
    'صدور الدجاج',
    'سمك التونا',
    'ستيك البقرى',
    'البيض',
    'الحليب',
    'لبن قليل الدسم',
    'جبن البارميزان المبشور',
    'الجبنة الامريكية',
    'جبنة الشيدر',
  ];

  static const gramsInFood = [
    '32.1 جرام',
    '29.9 جرام',
    '28.7 جرام',
    '6.12 جرام',
    '8 جرام',
    '5.7 جرام',
    '35.8 جرام',
    '27 جرام / 5 جرام بروتين',
    '33 جرام',
  ];

  static const List<String> potassiumVegets = [
    'أوراق الشمندر',
    'البطاطا',
    'السبانخ',
    'الفطر الأبيض',
    'البطاطا الحلوة',
    'الطماطم',
    'كرنب بروكسل',
    'الكوسا',
    'البروكلي',
    'الخرشوف',
    'البازلاء',
    'الهليون',
    'ذرة الحلوة',
    'القرع',
  ];
  static const List<String> potassiumFriuts = [
    'الأفوكادو',
    'الجوافة',
    'الكيوي',
    'الموز',
    'الشمّام',
    'الرمان',
    'المشمش',
    'البرتقال',
    'الكرز',
    'المشمش المجفف',
    'اليوسفي',
    'المانجو',
    'التوت',
    'البابايا',
    'البرقوق',
    'الفراولة',
    'توت العلّيق الأسود',
  ];
  static const List<String> otherPotassiumFoods = [
    'العدس',
    'الحليب',
    'الزبيب',
    'الفاصولياء السوداء',
    'معجون الطماطم',
    'ماء جوز الهند',
    'الفاصولياء البيضاء',
    'الأطعمة البحرية مثل:',
    'السلمون الأطلسي البري',
    'سمك الماكريل',
    'سمك الهلبوت',
    'سمك السلمون المرقط',
  ];
  static const List<String> allowedFoodsmanyTimes = [
    'اللحوم وبدائله	:',
    'بياض البيض',
    'فول مقشر 3ملاعق كبيرة',
    'الخبز والنشويات:',
    'نشأ الذرة –سكر المائدة',
    'العسل الأبيض- المربى',
    'الدهون	:',
    'الزيوت النباتية – (زيت الزيتون-زيت الذرة-زيت بذرة القطن)',
    'الخضروات  والفواكه:',
    'لوبيا خضراء – كوسا',
    'فاصولياء خضراء - تفاح',
    'الألبان ومنتجاتها',
    'المشروبات والأعشاب:',
    'المشروبات الطبيعية (الشاي الأخضر-الينسون-الشمر)',
  ];
  static const List<String> allowedFoods1or2TimesAday = [
    'اللحوم وبدائلها	:',
    'قرص طعمية –سمك ابيض',
    'دجاج',
    'الخبز والنشويات :',
    'المكرونة او الأرز- الخبز الشامي',
    'الكورن فليكس (رقائق الذرة)',
    'الخبز اللبناني',
    'الألبان ومنتجاتها',
    'كوب صغير من اللبن او الزبادي خالي الدسم',
    'قطعة جبن قريش في حجم البيضة',
    'الخضروات والفواكه :',
    'فلفل أخضر-بازيلاء',
    'خيار بدون قشره – ثمره صغيرة من الطماطم',
    'الدهون :',
    'الزيوت النباتية – (زيت الزيتون-زيت الذرة-زيت بذرة القطن',
    'المشروبات والأعشاب :',
    'التوابل مثل الكمون والكزبرة بمعدل 2-3 ملاعق صغيرة',
  ];
  static const List<String> allowedFoods3or4TimesAday = [
    'اللحوم وبدائلها	:',
    'فول مدمس – مكرونة-سمك',
    'الخبز والنشويات :',
    'الخبز البلدي- مسحوق البقسماط العادي',
    'الدهون	:',
    'من 4-5 ملاعق من الفول السوداني-البندق(الغير محمص)-اللوز الغير محمص',
    'الخضروات والفواكه :',
    'البامية-الخس-الجزر',
    'الكاكا-الجوافة',
    'المشروبات والأعشاب :',
    'ملعقة صغيرة من الزنجبيل- قرنفل',
    'الألبان ومنتجاتها :',
    'جبنه بيضاء نصف دسمة بحجم البيضة',
  ];
  static const List<String> allowedFoods2or3TimesAmonth = [
    'اللحوم وبدائلها :',
    'البيض الكامل (صفار+ البيض)',
    'الجمبري-الديك الرومي- الكبدة (في حجم البيضة)',
    'الخبز والنشويات :',
    'التوست الأسمر –البليلة (القمح الكامل)',
    'حبوب الشعير – منتجات دقيق الذرة',
    'الدهون :',
    'القشدة',
    'من3-4 حبات من المكسرات',
    'زبدة',
    'الخضروات والفواكه :',
    'المشروم',
    'المشروبات والأعشاب :',
    'الكاكو أو مسحوق الشوكولاتة',
    'الألبان ومنتجاتها :',
    'كوب صغير من اللبن الرائب',
    'كوب من الايس كريم',
  ];
  static const List<String> forbeddinFood = [
    'اللحوم وبدائلها	:',
    'صفار البيض-(اللحوم المصنعة)',
    'اللانشون – البرجر – السجق - البلوبيف',
    'الخبز والنشويات :',
    'الردة -الحلاوة الطحينية-المخبوزات-البرغل',
    'الكرواسون-الفريك',
    'الدهون	:',
    'المايونيز – الطحينية ومنتجاتها –زبدة الفول السوداني',
    'الخضروات والفواكه :',
    'الخضروات المعلبة',
    'المشروبات والأعشاب :',
    'المشروبات الغازية بجميع أنواعها – مرق الدجاج',
    'البيكنج باودر',
    'الألبان ومنتجاتها :',
    'الجبن المثلثات – الجبن المطبوخ –الجبن الرومي',
    'جبنة الموتزيريلا والشيدر',
    'اللبن كامل الدسم والشوكولاتة',
  ];
}

enum AuthUserState { doctor, patient }
