import 'dart:convert';

import 'package:flutter/material.dart';
import 'package:google_maps_flutter/google_maps_flutter.dart';
import 'package:http/http.dart' as http;

class Constants {
  static const textFieldColor = Color(0xFFF1F6FF);
  static const darkColor = Color(0xFF1F1F1F);
  static const color2 = Color(0xFF09c6f9);
  static const String patientsCollectionName = 'patients';
  static const String doctorsCollectionName = 'doctors';
  static const String chatsCollectionName = 'chats';
  static const String appName = 'مرضى الفشل الكلوى';
  static const String fontName = 'elmessiri';
  static const List<String> foods = [
    'صدور الدجاج',
    'سمك التونا',
    'ستيك البقرى',
    'البيض',
    'الحليب',
    'لبن قليل الدسم',
    'جبن البارميزان المبشور',
    'الجبنة الامريكية',
    'جبنة الشيدر',
  ];

  static const gramsInFood = [
    '32.1 جرام',
    '29.9 جرام',
    '28.7 جرام',
    '6.12 جرام',
    '8 جرام',
    '5.7 جرام',
    '35.8 جرام',
    '27 جرام / 5 جرام بروتين',
    '33 جرام',
  ];

  static const List<String> potassiumVegets = [
    'أوراق الشمندر',
    'البطاطا',
    'السبانخ',
    'الفطر الأبيض',
    'البطاطا الحلوة',
    'الطماطم',
    'كرنب بروكسل',
    'الكوسا',
    'البروكلي',
    'الخرشوف',
    'البازلاء',
    'الهليون',
    'ذرة الحلوة',
    'القرع',
  ];
  static const List<String> potassiumFriuts = [
    'الأفوكادو',
    'الجوافة',
    'الكيوي',
    'الموز',
    'الشمّام',
    'الرمان',
    'المشمش',
    'البرتقال',
    'الكرز',
    'المشمش المجفف',
    'اليوسفي',
    'المانجو',
    'التوت',
    'البابايا',
    'البرقوق',
    'الفراولة',
    'توت العلّيق الأسود',
  ];
  static const List<String> otherPotassiumFoods = [
    'العدس',
    'الحليب',
    'الزبيب',
    'الفاصولياء السوداء',
    'معجون الطماطم',
    'ماء جوز الهند',
    'الفاصولياء البيضاء',
    'السلمون الأطلسي البري',
    'سمك الماكريل',
    'سمك الهلبوت',
    'سمك السلمون المرقط',
  ];

  static const List<String> allowedFoods2or3TimesAmonth = [
    // 'اللحوم وبدائلها :',
    'البيض الكامل (صفار+ البيض)',
    'الجمبري-الديك الرومي- الكبدة (في حجم البيضة)',
    // 'الخبز والنشويات :',
    'التوست الأسمر –البليلة (القمح الكامل)',
    'حبوب الشعير – منتجات دقيق الذرة',
    // 'الدهون :',
    'القشدة',
    'من3-4 حبات من المكسرات',
    'زبدة',
    // 'الخضروات والفواكه :',
    'المشروم',
    // 'المشروبات والأعشاب :',
    'الكاكو أو مسحوق الشوكولاتة',
    // 'الألبان ومنتجاتها :',
    'كوب صغير من اللبن الرائب',
    'كوب من الايس كريم',
  ];
  static const List<String> forbeddinFood = [
    'اللحوم وبدائلها	:',
    'صفار البيض-(اللحوم المصنعة)',
    'اللانشون – البرجر – السجق - البلوبيف',
    'الخبز والنشويات :',
    'الردة -الحلاوة الطحينية-المخبوزات-البرغل',
    'الكرواسون-الفريك',
    'الدهون	:',
    'المايونيز – الطحينية ومنتجاتها –زبدة الفول السوداني',
    'الخضروات والفواكه :',
    'الخضروات المعلبة',
    'المشروبات والأعشاب :',
    'المشروبات الغازية بجميع أنواعها – مرق الدجاج',
    'البيكنج باودر',
    'الألبان ومنتجاتها :',
    'الجبن المثلثات – الجبن المطبوخ –الجبن الرومي',
    'جبنة الموتزيريلا والشيدر',
    'اللبن كامل الدسم والشوكولاتة',
  ];

  static const List<String> advices = [
    '1-	مُمارسة تمارين الاسترخاء مثل اليوغا، التأمل وتمارين التنفّس لأنها تُخفّف من الضغط النفسي والتوتّر وحتى الاكتئاب الذي يُصيب مرضى الفشل الكلوي نتيجة المرض .',
    '2-	الاقلاع عن التدخين .',
    'تناول سن ثومة مُقطّع مع ملعقة عسل صباحاً وكذلك مساءاً. مُمكن ومُفضّل تناول سِنّان صباحاً وكذلك مساءاً لمن يُعاني من ارتفاع كبير بالكرياتينين -3 .',
    '4-	تناول الخضراوات الطازجة أو المجمدة مع الابتعاد عن تلك المعلبة لأنها تحتوي على نسب عالية من الأملاح .',
    '5-	تناول الأغذية الغنيّة بفيتامينات C  ،B2 ،A. من أهم نصائح لمرضى الفشل الكلوي .',
    '6-	الحد من العطش قدر الامكان .',
    '7-	تناول الخضار التي تحتوي على فيتامين B الخضراوات الورقيّة الخضراء، الفطر. من أهم نصائح لمرضى الفشل الكلوي .',
    '8- تناول الخضار والفواكه التي تحتوي على فيتامين C الفلفل الحار، الفلفل الحلو، الأعشاب الطازجة، الخضار الورقيّة الداكنة، البروكلي، القرنبيط، الأناناس، البطيخ .',
    '9-	تناول الخضار والفواكه التي تحتوي على فيتامين :  Aالفلفل الحلو، الفلفل الحار، الشطة، الجزر، الخضراوات الداكنة، الأعشاب المُجفّفة، الخس والمشمش المُجفّف .',
    '10-	تناول الأغذية الغنيّة بأوميجا مثل الشوفان، الجوز، الفاصولياء، اللّوبياء، بذور الكتان، المكسّرات النيئة، بذور اليقطين، السمسم وزيت الزيتون .',
    '11-	تناول الأغذية التي تحتوي على الزنك مثل البقوليات، المكسّرات، اللّوز، بذور القرع، الحبوب الكاملة وبراعم القمح .',
    '12-	تناول البروتين النباتي بكميّات قليلة دون إكثار يُنصح بتناول البقوليّات والحبوب الكاملة مثل القمح المقشور، الكينوا،الفريكة، الحنطة السوداء، الشعير، البرغل، لب القرع، لب عباد الشمس، بذور الشياء، اللّوبياء، البازلاء الخضراء، الفول السوداني، زبدة الفول السوداني، اللّوز، الفستق، الكاجو، الفاصولياء البيضاء، الفاصولياء السوداء، العدس، الحمص، فول الصويا، الفول .',
    '13-	تناول الأغذية الغنيّة بالكالسيوم مثل: اللّوز، حليب الصويا، التوفو، السمسم، الحبوب الكاملة والبقوليات..تناول المكسّرات كونها غنيّة بفيتامينات C ،B2 ،Aخاصّةً الجوز .',
    '14- يجب الإقلال من تناول الخضر والفاكهة الطازجة لاحتوائها على كميات عالية من البوتاسيوم .',
    '15-	يجب إعطاء المريض كمية البروتين المحددة له في النظام الغذائي .',
    '16-	 تقدم اللحوم للمريض مسلوقة بدون ماء الحساء .',
    '17-	تناول الخضروات الطازجة مثل الجزر، الخيار، الخس، البروكلي، الملفوف، القرنبيط والثوم. من أهم نصائح لمرضى الفشل الكلوي .',
    '18-	تناول الفواكه التالية: التوت البري، الفراولة، الكرز، العنب الأحمر والتفاح.تناولالهليون الأخضر أو المطبوخ . تناول السبانخ، الفطر، الخرشوف، الطماطم المُجفّفة، والافوكادو لكونها تحتوي على البروتين النباتي .',
    '19-	تناول الخضار الغنيّة بأوميجا 3 مثل الخس، السبانخ، والبروكلي.تناول الخضار والفواكه الغنيّة بالكالسيوم مثل الخضار الورقيّة، السبانخ، الملفوف، القرنبيط والتين .',
    '20-	الحد من الصوديوم (الأملاح) .',
    '21-	تناول الفاكهة الطازجة بدلا من لوجبات المملحة .',
    '22-	تناول اللحوم الطازجة .',
    '23-	لابد من تقليل كمية الفوسفات في الغذاء، ومن تلك الأطعمة الغنية بالفوسفات البيض واللبن والجبن .',
    '24-	لتقيل كمية الأملاح في الخضار تسلق ويستغنى عن ماء السلق وتغسل مرتين بعد السلق .',
    '25-	لا يوضع الملح في إعداد الأطعمة لمنع ارتفاع ضغط الدم .',
    '26-	يجب البعد عن تناول المعلبات لارتفاع نسبة الصوديوم بها والتي تضاف كمواد حافظة مثل بنزوات الصوديوم .',
    '27-	الالتزام بالنظام الغذائي المحدد، وذلك حفاظاً على حياة المريض من حدوث المضاعفات .',
    '28-	عدم الإفراط في تناول المياه الغازية .',
    '29-	الحد أو الامتناع عن تناول الألبان .',
    '30-	تحديد كمية الصوديوم الموجود في الطعام وتحتوي بعض الأطعمة على نسبة عالية من الصوديوم مثل الخضروات، حيث نجد أن كل 100 جرام يحتوي على 9 مليجرام صوديوم، بينما ترتفع هذه النسبة في الألبان لتصل إلى ما يقرب مني500 مليجرام في 100 جرام لبن .',
    '31-	الحد من معدلات البوتاسيوم في دم الأنسان .',
    '32-	تجنب تناوله بعد الفواكه مثل الأفوكادو والموز والكيوي والفاكهة المجففة التي نحتوي على نسب عالية من البوتاسيوم .',
    '33-	عدم التعرض للشمس فترات طويلة، خاصة الشمس الشديدة أو القيام بمجهود عضلي، حتى لا يحدث عرق شديد، الأمر الذي يجعل المريض مضطراً لزيادة حجم السوائل التي هو في غنى عنها .',
    '34-	قبل أن يقوم الشخص بالغسل الكلوي ينصحه الطبيب بضرورة إتباع نظام غذائي منخفض في نسبة البروتينات .',
    '35-	أما اثناء الغسيل الكلوي فهذه النصيحة تتغير وينصح الطبيب بتناول نظام غذائي يحتوىعلى قدر كاف من البروتينات ,  لأن البروتينات تساعد على اعادة بناء الأنسجة و العضلات .',
  ];

  static const List<Map<String, dynamic>> treatmentCenters = [
    {
      'name': 'مركز بن محفوظ (الخصوصى)',
      'hospital': 'مستشفى الجمهورية التعليمى',
      'workTime': '7ص : 6م',
      'phoneNum': '02235906',
      'latlng': LatLng(12.805957, 45.038057),
    },
    {
      'name': 'مركز الغسيل الكلوى الحكومى',
      'hospital': 'مستشفى الجمهورية التعليمى',
      'workTime': '',
      'phoneNum': '02271000',
      'latlng': LatLng(12.805898, 45.038124),
    },
    {
      'name': 'قسم الغسيل الكلوى',
      'hospital': 'مستشفى الصداقة',
      'workTime': '',
      'phoneNum': '+9672383664',
      'latlng': LatLng(12.876927, 44.982896),
    },
    {
      'name': 'مركز عبود للغسيل الكلوى',
      'hospital': 'خور مكسر بجانب المطار',
      'workTime': '',
      'phoneNum': '',
    },
  ];

  Future<bool> sendFcmMessage(
      String title, String message, String token) async {
    try {
      var url = 'https://fcm.googleapis.com/fcm/send';
      var header = {
        "Content-Type": "application/json",
        "Authorization":
            "key=AAAAxa8VtvE:APA91bElT3tK1bzmsFONNOOIRpGcPE5HHpM4kQnQPaHf0z9IaTdA2EPSMDvZ8Tsfw_53Ls91NSn75RnL2MMbT8OQ9I8su9cTqupfzJ2EOIJAfl06VxiV7I0m4x9NtUmlTiYKxDkcYWZM",
      };
      var request = {
        'notification': <String, dynamic>{
          'body': '$message',
          'title': '$title'
        },
        'priority': 'high',
        'data': <String, dynamic>{
          'click_action': 'FLUTTER_NOTIFICATION_CLICK',
          'id': '1',
          'status': 'done'
        },
        'to': '$token',
      };

      await http.post(Uri.parse(url),
          headers: header, body: json.encode(request));
      print('donnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnne');
      return true;
    } catch (e) {
      print(e);
      return false;
    }
  }
}

enum UserType { patient, doctor }
enum AuthUserState { doctor, patient }
